---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.LessThanTwoBars
source: html/88e6bdfe-1991-203a-cf1b-9b45c49816f6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.LessThanTwoBars Property

Each reinforcement direction requires at least 2 bars. Please increase the number of bars.

## Syntax (C#)
```csharp
public static FailureDefinitionId LessThanTwoBars { get; }
```